<!--首次协议确认-->
<template lang="pug">
  .box
    .content
      .title 美团智能支付合作协议
      .text
        p(class="m-t-10") 商户服务协议（“本协议”）由以下双方签署:
        p(class="m-t-10 t-h") 1.北京钱袋宝支付技术有限公司（“甲方”）：为商户提供全方位的技术接入支持服务；
        p(class="m-t-10 t-h") 2.注册商户（“乙方”）：与甲方或甲方关联公司签订服务合同的商户，并通过甲方的服务，接入相应金融机构。
        p(class="m-t-10") 双方经友好协商，进一步达成本协议，以资共同恪守。
        p(class="m-t-10 font-w") 一、商户资格和信息资料
        p(class="m-t-10 t-h") 1.1 乙方有义务根据甲方和甲方或甲方关联公司合作方的要求提供所有必要的信息和资料，包括但不限于营业执照、负责人身份证等，并在该等文件上加盖公章。
        p(class="m-t-10 t-h") 1.2 甲方有权向合作方提供乙方的上述证明材料和信息，并为自身或支付合作方的要求对上述证明材料的真实性和有效性进行核实。当甲方或支付合作方为乙方提供回访服务或进行终端相关业务检査时，乙方应积极配合甲方和支付合作方的相关人员工作，如甲方或支付合作方提出合理的签字、盖章等要求，乙方不得拒绝。甲方和支付合作方有权审查乙方提交的资质证明材料，如经审查，甲方或支付合作方认为乙方不具备或部分不具备申请资质，甲方或支付合作方均有权拒绝向乙方提供服务。
        p(class="m-t-10 t-h") 1.3 乙方对其所提供材料和信息的准确性、完整性、合法性和真实性承担责任。在任何信息发生变更时，立即书面通知到甲方。乙方在注册材料中填写的通讯地址和方式为甲乙双方同意，任何书面通知只要发往以上地址，均视为已送达。。
        p(class="m-t-10 t-h") 1.4 乙方应确认其具有签约主体资格，并已就本协议的签署和履行取得了所有必要的授权，以确保签约有效。何功能。
        p(class="m-t-10 t-h") 1.5 乙方已知悉并完全理解本协议内容，同意按照本协议的有关条款执行。
        p(class="m-t-10 font-w") 二、支付接入技术方案
        p(class="m-t-10 t-h") 2.1 乙方申请通过甲方平台接入并使用以下服务（合称“支付解决方案”）
        p(class="m-t-10 t-h")     微信支付解決方案
        p(class="m-t-10 t-h")     微信支付解決方案
        p(class="m-t-10 t-h") 根据乙方的申请，甲方将根据支付解決方案所对应的支付合作方的要求对乙方的资质进行审査，是否开通上述支付解决方案以及开通哪些支付解决方案，以甲方和支付合作方的审査为准。
        p(class="m-t-10 t-h") 2.2 乙方无论使用的以上任一或全部服务，均应遵守本协议项下的各项约定，以及所有适用法律法规和监管部门、结算机构、支付合作方的规定和要求。
        p(class="m-t-10 font-w") 三、服务费用
        p(class="m-t-10 t-h") 3.1 支付接入技术解决方案服务费用标准，详见甲方不时公布的费用调整方案。
        p(class="m-t-10 t-h") 3.2 乙方使用本协议项下的任何服务即视为知悉并认可该等服务费用标准。 甲方提供任何免费试用或减免任何功能和服务的费用不应视为甲方放弃后续收费的权利。乙方未能支付任何服务费用，甲方有权随时暂停或终止提供本协议项下的任何和所有服务。
        p(class="m-t-10 t-h") 3.3 除紧急情况外，甲方有权根据实际情况提前5个工作日单方调整服务费用标准及收费方式，并以公告形式通知乙方。如乙方不同意该等收费调整应当立即停止服务的使用，否则使用则视为乙方已同意并应当缴纳费用。
        p(class="m-t-10 font-w") 四、甲方的权利和义务
        p(class="m-t-10 t-h") 4.1 甲方基于与支付合作方的约定和乙方的授权，有权选择签约的支付合作方，以向乙方提供支付解決方案服务。
        p(class="m-t-10 t-h") 4.2 甲方将提供支付解决方案服务的系统平台，以有效对接乙方和支付合作方，并为此提供各方面的技术支持服务。
        p(class="m-t-10 t-h") 4.3 甲方和支付合作方有权根据情况决定对服务进行改动和升级，并暂停向乙方提供服务，但应提前告知乙方，并预告恢复日期。
        p(class="m-t-10 t-h") 4.4 乙方产品或服务的消费、退货等交易是乙方与购买并接受其产品或服务的客户（以下“客户”）之间的债权债务关系，甲方和支付合作方仅为确定支付的交易方式和交易流程并协助乙方实现交易的支付解決方案合作方以及会员服务系统的提供商，并不承担甲乙双方约定之外的任何经济纠纷的责任。
        p(class="m-t-10 t-h") 4.5 甲方和支付合作方有权对终端收款业务的过程进行风险监控和管理。
        p(class="m-t-10 t-h") 4.6 甲方和支付合作方所提供的服务将需要乙方提供其银行账户信息，在乙方提供相应信息后，甲方和支付合作方将严格履行相关保密约定。甲方和支付合作方有权共享乙方的各项入网及交易信息，以便向乙方提供各项增值服务或产品，但应保证其所共享的乙方各项数据的合理使用及安全性。
        p(class="m-t-10 t-h") 4.7 为了保障乙方使用本协议项下的服务的安全以及不断改进服务质量，甲方将记录并保存乙方登录和使用相关服务的信息，但甲方承诺不将此类信息提供给除甲方和支付合作方外的其他任何第三方（除双方另有约定或法律法规/监管机构另有规定及甲方关联公司外）。
        p(class="m-t-10 t-h") 4.8 如甲方与特定支付合作方的合作终止，甲方有权终止向乙方提供该等支付解决方案的服务，但应尽可能为乙方推荐其他支付解决方案。
        p(class="m-t-10 t-h") 4.9 甲方将不定期的与支付合作方共同开展或单独开展营销和推广活动，乙方可以参加该等活动并支持甲方宣传物料的展示。如该等活动期间发生现金补贴或其他需要结算的营销方式，双方应于每期活动结束后根据甲方届时公布的活动规则进行核对和结算。
        p(class="m-t-10 font-w") 五、乙方的权利和义务
        p(class="m-t-10 t-h") 5.1 乙方承诺按照本协议的要求妥善使用本协议项下的服务，不得允许乙方之外的其他人未经甲方授权使用服务或将服务用于协议许可范围以外的用途；不得将账号转借他人。除非事先另有约定，未经甲方书面允许，不得将其他商户交易假冒本商户交易；不得使用本协议项下的服务虚构交易为客户提取现金。因违规操作而导致的任何经济损失及相应的法律责任均应由乙方承担，如造成甲方或支付合作方损失的，乙方负责全额赔偿。
        p(class="m-t-10 t-h") 5.2 乙方在此不可撤销地授权并委托甲方，向支付合作方提供乙方的信息和资料，以甲方和/ 或乙方的名义与有资质的支付合作方签订相关的用户服务协议。乙方认可，为乙方使用本协议项下的服务之目的，甲方有权自行选择签约的支付合作方。
        p(class="m-t-10 t-h") 5.3 除非另有约定，乙方对所有甲方及其支付合作方支持的客户及各类本协议项下的支付接入技术解决方案的受理必须一视同仁，不得以任何理由刁难或拒绝任何一种支付解决方案的合法交易，也不得对使用特定支付解决方案的客户提供低于采用现金支付水平的产品或服务。甲方不得将应付的交易手续费或服务费用转嫁给其客户。如有违反，甲方及其支付合作方将对该笔交易款项予以拒付并退单，所造成的经济损失由乙方承担。
        p(class="m-t-10 t-h") 5.4 乙方收银人员在使用本协议的服务受理支付交易时，应按照支付合作方的具体要求和流程确认交易手段和交易金额的准确性。乙方未按照要求执行而导致的经济损失，由乙方自行承担。
        p(class="m-t-10 t-h") 5.5 乙方应保证支付凭证上信息与商户消费凭证等信息保持一致，甲方不得将支付凭证用于本协议许可范围以外的用途，也不得提供给任何第三方使用。交易发生后，客户对交易产生异议的，甲方和支付合作方有权向乙方调阅相关文件，乙方有义务配合甲方及支付合作方提供相关书面文件，如支付凭证、出货单等，若乙方未能履行义务而导致客户拒付，拒付交易款损失由乙方自行承担。交易款损失将从乙方后续交易资金中直接扣除，如乙方后续交易不足以支付客户拒付金额的，甲方和支付合作方有权代客户向乙方追偿。
        p(class="m-t-10 t-h") 5.6 乙方应严格按照国家法律法规和人民银行、 结算机构和支付合作方的要求受理支付请求，不得进行违法违规操作，包括但不限于分单操作、套现、虚假交易等，乙方未按有关规定操作或有以上违法违规行为的（以甲方和支付合作方的认定为准），清算机构将有权采取（包括但不限于）调单、挂账、限制清算、征收惩罚性手续费、限制/暂停交易措施，对于违法行为乙方应承担相应的法律责任，若给甲方、支付合作方或其他第三方帯来损失的，乙方承担赔偿责任。
        p(class="m-t-10 t-h") 5.7 当乙方发生主体资格变更、重大资产和/或股权变更、业务承包或转让时应及时通知甲方，并应事先征得甲方和支付合作方的同意，并重新办理入网手续。否则甲方和/或支付合作方均有权停止终端交易，并通知清算机构对交易资金做挂账处理 。
        p(class="m-t-10 t-h") 5.8 乙方同意甲方和支付合作方可合理使用其风险信息，同时乙方有责任向甲方提供有关银行卡和移动支付诈骗案件中必要的线索和证据，并协助甲方、支付合作方和有关部门处理案件。
        p(class="m-t-10 t-h") 5.9 合规性
        p(class="m-t-15 t-h") (1)乙方应保证其经营活动和范围的合法性，保证不得将甲方和支付合作方提供的服务用于任何可能违反法律法规或侵害乙方、支付合作方或第三方合法权益的活动。因违反上述内容而造成的一切严重后果，由乙方自行承担责任。
        p(class="m-t-15 t-h") （2）甲方和支付合作方有权监督乙方使用服务的情况。如根据甲方和支付合作方合理的独立判断认为乙方存在或可能存在违反法律法规或侵害甲方、支付合作方或其他第三方合法权益的行为，甲方有权单方面终止本协议，冻结或扣除乙方的未结算款项，要求乙方赔偿甲方和支付合作方因此遭受的全部损失并承担本协议约定的各项违约责任和其他法律责任。
        p(class="m-t-15 t-h") （3）乙方应就其自身提供的产品和服务的合法性负责，由于乙方提供的产品或服务质量等问题引起的一切纠纷及经济损失，将由乙方自行承担，与甲方或其支付合作方无关，因此导致甲方和支付合作方损失的，乙方应全额赔偿。
        p(class="m-t-15 t-h") （4）乙方应遵守国家法律法规和相关规定以及各种社会公共利益或公共道德，如有违反导致任何法律后果的发生，乙方将以自己的名义独立承担所有相应的法律责任。
        p(class="m-t-15 t-h") （5）如支付合作方或相关机构要求，乙方应与支付合作方就收款服务另行签署用户服务协议，并满足支付合作方及清算机构对申请人不时提出的合规要求。由于支付合作方、清算机构或监管部门认为乙方未能满足其合规要求而终止向其提供服务的，甲方有权同时终止本协议。
        p(class="m-t-15 t-h") （6）乙方不以任何形式误导客户、做虚假宣传或参与任何违法犯罪活动。
        p(class="m-t-10 t-h") 5.10 乙方有义务配合甲方和支付合作方对终端收款业务的过程所进行风险监控和管理。
        p(class="m-t-10 t-h") 5.11 乙方有权要求甲方按照本协议的约定和甲方不时公布和调整的服务内容提供服务，但甲方不对乙方营销推广的效果提供承诺。
        p(class="m-t-10 t-h") 5.12 乙方应在本协议签订后的7日内完成其中请获批的全部支付解决方案的平台接入及收银员培训，并在其门店内指定位置加贴并长期展示甲方提供的门贴、 收银帖等含有甲方logo的宣传物料。
        p(class="m-t-10 t-h") 5.13 乙方应确保客户使用服务的质量和客户体验。如果甲方多次收到客户投诉，而乙方无法妥善处理的，甲方有权要求乙方对其人员进行调整和再次培训 。
        p(class="m-t-10 font-w") 六、保密条款
        p(class="m-t-10 t-h") 6.1 双方均应严格遵守法律法规的相关保密规定以及支付合作方、银联和监管机构的保密要求，并对在本协议过程中知悉的其他方的各项技术、情报、资料、信息、数据、 商业秘密及由此产生的技术成果承担严格的保密义务，但依据国家法律、法规、监管规定要求提供的除外。除按前述约定提供相关信息外，如需向其它任何第三方提供该等信息的，应事先得到对方的许可，并明确使用范围、时间和内容。这里的“信息”是指任何以口头、书面、图表或电子方式存在的双方过去、现在或将来的商业计划、规章制度、财务信息、技术方案、操作手册等资料。
        p(class="m-t-10 t-h") 6.2 双方均应建立详细的内部保密制度，并提供培训、检査等方式确保交易信息和数据的安全，限制数据访问权限并定期或者不定期更换账户的使用密码。
        p(class="m-t-10 t-h") 6.3 为能够更为有效地提供服务，乙方同意，甲方有权将乙方注册及使用本服务过程中所提供、形成的信息提供给支付合作方和必要的甲方关联公司。同时，甲方为更安全有效地向乙方提供服务，根据法律法规的规定，或甲方或支付合作方需识别乙方身份，或甲方或支付合作方认为乙方账户存在风险时，甲方和支付合作方有权要求乙方进一步提交身份信息。除本协议另有规定外，甲方不对外公开或向第三方提供乙方的信息，但以下情况除外：
        p(class="m-t-15 t-h") （1）事先获得乙方的明确授权；
        p(class="m-t-15 t-h") （2）只有披露乙方的信息，才能提供其需要的产品和（或）服务；
        p(class="m-t-15 t-h") （3）按照本协议的要求进行的披露；
        p(class="m-t-15 t-h") （4）根据法律法规的规定；
        p(class="m-t-15 t-h") （5）按照政府主管部门的要求；
        p(class="m-t-15 t-h") （6）为维护甲方及其关联公司的合法权益；
        p(class="m-t-15 t-h") （7）对乙方甲方的身份真实性进行验证。
        p(class="m-t-10 t-h") 6.4 在本协议的签订过程中、存续期间以及协议终止后, 乙方始终负有保守其与甲方和支付合作方之间交易信息等商业秘密的义务，乙方应承担因泄露商业秘密而造成的一切损失的赔偿责任。如有任何保密信息被非法取得或外泄，乙方应第一时间告知甲方，并立即采取措施减少甲方和支付合作方的损失。
        p(class="m-t-10 t-h") 6.5 未经甲方书面同意，乙方不得向任何单位、个人透露客户资料、交易信息、银行卡卡号以及任何交易支付资料，国家另有规定的除外。
        p(class="m-t-10 font-w") 七、不可抗力和免责条款
        p(class="m-t-10 t-h") 7.1 由于发生地震、台风、水灾、火灾等人力不能预见、不能通免、不能克服的不可抗力事件，致使本协议无法履行或不能按约定履行，遭遇不可抗力的一方应于不可抗力发生之日起10个工作日内以书面形式通知协议另一方，并及时出具有关部门的证明文件。因不可抗力造成的损失，双方互不承担责任，双方应在合理时限内协商是否继续履行协议。
        p(class="m-t-10 t-h") 7.2 鉴于电子商务的特殊性质，甲方对黑客攻击、网络病毒、银行系统故障、电信部门技术调整及线路故障、银行政策调整导致之影响、因政府管制而造成的暂时性关闭、电力系统故障或限制性供电等在内的任何影响网络正常经营之情形不承担责任，若造成业务无法继续开展的，乙方负责配合甲方处理相关事宜。
        p(class="m-t-10 t-h") 7.3 因国家金融法律法规或结算机构、支付合作方的调整等不可抗力因素，造成业务无法继续开展的，乙方负责配合甲方处理相关事宜。
        p(class="m-t-10 t-h") 7.4 在法律允许的情况下，甲方对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失）均不负有任何责任，即使乙方事先已被告知此等损失的可能性。在任何情况下，甲方对本协议所承担的赔偿责任总额不超过连续12个月乙方支付的服务费用总额。
        p(class="m-t-10 font-w") 八、知识产权
        p(class="m-t-10 t-h") 8.1 本协议项下的产品和服务中所包含的技术、专有技术（(不论是否已取得专利权）以及知识产权（包括但不仅限于专利、版权、商标等），均为甲方或其他相应的所有者所有。除非本协议明确约定，本合同的任何条款都不得被认为是一方直接或暗示或以其他方式将上述知识产权授予或转让给另一方。
        p(class="m-t-10 t-h") 8.2 甲方是甲方一系列商标的合法拥有者或授权使用者，除本协议明确约定外，甲方未授予乙方以任何方式使用甲方商标的权利。乙方使用甲方产品或服务时不得实施去除、掩盖或涂抹甲方标识、更改标识或内容等侵犯甲方知识产权的任何行为。若乙方未经甲方授权将甲方的商标或标识等用于本协议目的之外，或在使用中给甲方造成不良影响的，甲方有权要求乙方在指定的时间内进行整改并消除影响，若乙方逾期未整改的，甲方有权终止本协议并要求乙方承担因此给甲方造成的损失。
        p(class="m-t-10 t-h") 8.3 乙方保证不复制、再生、反编译、反向工程、分解或者以其他方式复原程序的源代码或者甲方的技术。如果乙方不能完全遵守上述规定，应承担由此产生的所有后果和损失。
        p(class="m-t-10 t-h") 8.4 未经甲方和支付合作方书面同意，乙方不得利用甲方或其支付合作方的名义 （包括认证、授权、指定等名义）对外宣传或推广。
        p(class="m-t-10 font-w") 九、协议的违约和终止
        p(class="m-t-10 t-h") 9.1 乙方出现下述任一种情况，经指出仍拒不纠正的，甲方有权单方面书面通知乙方立即终止本协议：
        p(class="m-t-15 t-h") （1）自本协议签订之日起，连续三个月未受理支付业务的；
        p(class="m-t-15 t-h") （2）多次无故拒绝受理支付业务的；
        p(class="m-t-15 t-h") （3）多次严重违反支付业务受理操作规程的；
        p(class="m-t-15 t-h") （4）屡次无理拒绝或故意拖延乙方和支付合作方査询、査复和调单要求的；
        p(class="m-t-15 t-h") （5）多次收到客户投诉，无法妥善处理相关问题的；
        p(class="m-t-15 t-h") （6）经相关方申诉，乙方或支付合作方确认有严重违规行为的；
        p(class="m-t-15 t-h") （7）未按照约定支付服务费用的。
        p(class="m-t-10 t-h") 9.2 乙方出现以下任何一种欺诈行为或风险状况时，甲方有权单方面无条件终止本协议，且无须事先通知乙方，并立即终止其支付交易权限，所产生的相关经济损失由乙方承担，同时甲方还有权依法追究乙方相应的法律责任，要求乙方承担甲方和支付合作方的损失，并对其不良行为予以曝光：
        p(class="m-t-15 t-h") （1）未按约定流程进行支付业务受理操作，造成损失或经两次书面通知无效；
        p(class="m-t-15 t-h") （2）套现或被甲方或支付合作方认定有套现嫌疑：乙方与客户或其它第三方勾结，或乙方（或乙方员工）以虚拟交易套取现金；
        p(class="m-t-15 t-h") （3）虚假申请：以虚假资料或冒用其它商户的资料向甲方和支付合作方申请开通账号；
        p(class="m-t-15 t-h") （4）泄露账户及交易信息：乙方违反保密义务，将客户账户资料及交易数据信息泄漏给不法分子使用；
        p(class="m-t-15 t-h") （5）洗单：甲方将其它未签约商户的交易通过其帐户受理支付交易，假冒本店交易与支付合作方结算；
        p(class="m-t-15 t-h") （6）分单：为逃避对单次交易限额的限制而采用在短时间内同店铺、同账号、同卡号多笔交易；
        p(class="m-t-15 t-h") （7）恶意倒闭：乙方接受信用卡支付的预付款后故意破产，使甲方和交易合作方承担退单损失；
        p(class="m-t-15 t-h") （8）虚假交易：在客户不知情的情况下，甲方利用客户账户编造虚假交易或在客户消费的同时重复刷卡，并冒用客户身份进行虚假交易；
        p(class="m-t-15 t-h") （9）名义经营范围与实际情况不符，套用MCC码；
        p(class="m-t-15 t-h") （10）因支付相关的欺诈交易已被司法机关立案或介入调查；
        p(class="m-t-15 t-h") （11）中国银联或其他结算机构已书面通知支付合作方强制解约；
        p(class="m-t-15 t-h") （12）已被中国银联或其他卡组织认定为“高风险商户”；
        p(class="m-t-15 t-h") （13）经营不善，已破产或停业；
        p(class="m-t-15 t-h") （14）其他欺诈风险原因。
        p(class="m-t-10 t-h") 9.3 乙方不得通过支付解决方案进行洗钱活动，一经发现或被举报，甲方有权单方面无条件立即终止本协议，且无须事先通知乙方，并立即终止其支付受理权限，同时甲方还有权上报有关反洗钱主管部门，査处和追究乙方的法律责任，要求乙方承担甲方和支付合作方的损失，并对其不良行为予以曝光。双方应按照《中华人民共和国反洗钱法》和《金融机构客户身份识别和客户身份数据及事务历史记录保存管理办法》、 《支付机构反洗钱和反恐怖融资管理办法》等有关反洗钱的法律法规和双方协议约定履行反洗钱义务，并互相为对方在开展反洗钱工作上提供充分的协助。
        p(class="m-t-10 t-h") 9.4 除因违约导致本协议终止的情形外，任何一方终止本协议应必须提前15日以书面方式通知另一方。甲方有权在终止之日起关闭并删除乙方的账号。但本协议项下已经发生的权利义务，应继续履行至该等权利义务终了之时。
        p(class="m-t-10 t-h") 9.5 由于乙方存在违约行为（包括但不限于本条上述第10.1款至第10.3款所列各项），但甲方未决定终止本协议的，仍可追究乙方的违约责任，要求乙方赔偿甲方和支付合作方的损失，并对乙方采取一系列的限制措施，包括但不限于取消乙方参与营销活动的资格、撤销违规交易、要求乙方返还已减免的费用、限制交易和支付结算等。
        p(class="m-t-10 t-h") 9.6 本协议终止后的24个月内，如甲方收到支付合作方要求因以往交易引起的査询，乙方仍有义务配合甲方工作；如有交易因乙方违反本协议的条款导致发卡方拒付或退单的，甲方和支付合作方有权向乙方追索已付款项，由此造成的甲方和支付合作方的损失、发生的费用（包括但不限于诉讼费、仲裁费、律师代理费等）以及原交易损失均由乙方承担。
        p(class="m-t-10 font-w") 十、争议解决
        p(class="m-t-10 t-h") 10.1 本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律执行。
        p(class="m-t-10 t-h") 10.2 双方因本协议发生纠纷，应本着友好协商的原则商议解决，若协商不成，任何一方均有权提交北京仲裁委员会进行仲裁。除非另有规定，仲裁期间双方应当继续履行协议规定的义务。
        p(class="m-t-10 font-w") 十一、其他
        p(class="m-t-10 t-h") 11.1 本协议的初始有效期为1年，自双方签署且甲方批准乙方的服务申请并开通账户之日起生效。本协议有效期满后若双方无任何异议，本协议自动续展1年，且乙方应在到期日前一个月提供更新年检的各项证照。乙方认可，甲方有权提前5个工作日书面通知对本协议的内容进行调整，并以公告形式通知乙方但无需获得乙方的事先同意。如乙方不同意本协议的该等调整，应当立即停止使用本协议项下的全部服务，否则使用则视为乙方已同意并接受该等调整。
        p(class="m-t-10 t-h") 11.2 本协议的签订视为双方就支付解决方案事宜达成排他性合作关系。乙方不得在本协议期限内与除甲方以外的任何第三方合作，否则，乙方应按本协议约定承担相应的违约责任。
        p(class="m-t-10 t-h") 11.3 双方认可，本协议的签署和通知的发送可以通过客户端通知、书面、邮寄、电子邮件、传真、扫描件等形式进行，均应视为有效；对于本协议特别约定的内容, 甲方公告形式进行的通知亦视为有效送达。
        p(class="m-t-10 t-h") 11.4 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。
        p(class="m-t-10 t-h") 11.5 甲方于乙方过失或违约时放弃本协议规定的权利的，不得视为其对乙方的其他或以后同类之过失或违约行为弃权。
        p(class="m-t-10 t-h") 11.6 本协议应取代双方此前就本协议任何事项达成的全部口头和书面协议、安排、谅解和通信。
        p(class="m-t-10 t-h") 11.7 甲方有权根据业务调整情况将本协议项下的全部权利义务一并转移给其关联公司，转让将以本协议规定的方式通知，乙方承诺对此不持有异议。
      .submit-box
        .button(@click="closeModal") 关闭

</template>

<script>
  // import store from '../../vuex/store'
  // import { mapGetters } from 'vuex'
  // import userMixin from '@/mixins/modules/user'
  export default {
    name: 'agreeMeituan',
    methods: {
      closeModal () {
        this.$emit('close')
      },
    },
    mounted () {
    },
  }
</script>

<style scoped lang="stylus">
  @import '~@/stylus/mixins'
  .m-t-10
    margin-top 10px
  .m-t-15
    margin-top 15px
  .font-w
    font-weight bold
  p
    line-height 1.2
  .red
    color red
  .t-h
    text-indent 2em
  .t-h-4
    text-indent 4em
  .box
    width 100%
    height 100%
    position fixed
    top 0
    left 0
    background-color rgba(0,0,0,.5)
    z-index 999
    display: flex;
    align-items: center;
    .content
      width 600px
      height 90%
      background-color #ffffff
      margin auto
      padding 0 30px
      .title
        line-height 30px
        text-align center
        font-size 24px
        padding-top 20px
        padding-bottom 20px
      .text{
        width 100%
        height 80%
        border 1px solid #72767a
        overflow-y auto
        padding 10px 20px
      }
      .submit-box
        width 100%
        height 40px
        .button
          width 120px
          height 40px
          text-align center
          color #fff
          font-size 18px
          line-height 40px
          background-color #FFBB29
          border-radius borderRadius
          box-shadow 0 1px 3px 0 rgba(0, 0, 0, .05)
          cursor pointer
          display block
          margin 0 auto
          margin-top 10px
          &:hover
            background-color #FFC723
            box-shadow 0 4px 6px 0 rgba(255, 199, 35, .3), 0 4px 24px 0 rgba(0, 0, 0, .05)


</style>
